{
  "id": "beavis",
  "type": "npc",
  "definition": "monster",
  "name": "Beavis",
  "description": "A lanky teenage boy with blonde hair that stands up in a perpetual cowlick, seemingly defying both gravity and good grooming advice. His AC/DC t-shirt has seen better days, possibly better years. He wears a frozen expression of dim-witted enthusiasm, mouth slightly agape as if perpetually on the verge of saying something profoundly stupid. His eyes have the glazed look of someone whose last coherent thought occurred during the previous school year. Every few seconds, he snickers at something only he finds amusing, which is apparently everything. There's an unmistakable aura of chaos around him, like a natural disaster in human form, but somehow less destructive and more pathetic.",
  "keywords": ["beavis", "student", "teen", "teenage", "boy", "blonde"],
  "currentRoom": "school_hallway",
  "level": 4,
  "hp": 60,
  "maxHp": 60,
  "wanders": true,
  "heartbeatInterval": 25,
  "emoteChance": 0.15,
  "dialogueChance": 0.55,
  "wanderChance": 0.30,
  "territory": [
    "school_hallway",
    "school_classroom_01",
    "school_classroom_02",
    "school_entrance"
  ],
  "dialogue": [
    "Heh heh. Heh heh heh. This is cool.",
    "Fire! Fire! Heh heh. FIRE!",
    "This sucks. Heh heh. No wait, this rules! Heh heh.",
    "Heh heh. You said 'but'. Heh heh heh.",
    "Are we gonna like, DO stuff? Or just stand here? Heh heh.",
    "I am CORNHOLIO! I need TP for my bunghole! Heh heh.",
    "Heh heh heh. That was cool. Do it again.",
    "School sucks. Heh heh. But not as much as that time I ate a bug.",
    "Heh heh. Nachos rule. Everything else sucks. Heh heh heh.",
    "Whoa. This is like, heavy. Heh heh. No wait, it's stupid. Yeah.",
    "FIRE! FIRE! Heh heh heh! The school needs more fire!",
    "Heh heh. I'm gonna score. Just wait. Any day now. Heh heh.",
    "This one time, at the convenience store, heh heh, I saw this thing, and it was cool. Heh heh.",
    "Dammit, Butt-Head! No wait, what? Heh heh heh.",
    "I'm like, freaking out here. Heh heh. This is cool. Heh heh.",
    "Uh heh heh. Change is scary. Heh heh. But fire is cool!",
    "Stewart's a wuss. Heh heh. But he has cable. Heh heh heh.",
    "Heh heh. My mom says I have potential. She's stupid. Heh heh.",
    "Are there any chicks here? Heh heh. I need to practice my moves. Heh heh.",
    "FIRE! Heh heh heh heh! Did I mention FIRE? Heh heh!"
  ],
  "createdAt": "2025-11-13T12:00:00Z",
  "modifiedAt": "2025-11-13T12:00:00Z"
}
