{
  "id": "bodega_clerk",
  "type": "npc",
  "definition": "monster",
  "name": "Mr. Kim",
  "description": "A middle-aged man with the thousand-yard stare of someone who's spent the last decade watching teenagers contemplate shoplifting candy bars. He's wearing a faded polo shirt and has mastered the art of looking simultaneously vigilant and utterly exhausted. Behind him, a small TV plays a Korean drama at low volume, though his eyes never leave the store. His hand rests casually near the baseball bat he affectionately calls 'Policy Enforcement.' A name tag reads 'MR. KIM - OWNER/MANAGER/SECURITY/JANITOR/THERAPIST' in increasingly smaller text. The lines on his face tell the story of a man who's heard every excuse, seen every scam, and is profoundly unimpressed by all of it.",
  "keywords": ["kim", "clerk", "owner", "bodega", "shopkeeper", "korean"],
  "currentRoom": "bodega",
  "level": 4,
  "hp": 70,
  "maxHp": 70,
  "wanders": false,
  "heartbeatInterval": 60,
  "dialogue": [
    "You break it, you buy it. You touch it, you probably already broke it, so you buy it.",
    "No loitering! This isn't library. Library is three blocks that way.",
    "You want credit? What you think this is, BANK? Come back with MONEY.",
    "*eyes narrow* I'm watching you. I got eyes in back of head. Also security mirror. Mostly security mirror.",
    "These kids today... in MY day, we RESPECTED the bodega. Now they come in, read magazines, buy NOTHING.",
    "You see sign? 'No shoes, no shirt, no service.' You got shoes AND shirt? Okay, fine. What you want?",
    "Price on tag is price you PAY. This not negotiation. You think you at swap meet?",
    "Ah, you need change for laundromat? You buy something FIRST. Gum is fifty cent.",
    "*mutters* Twenty years I run this store. Twenty years! Not one 'thank you, Mr. Kim.' Nothing!",
    "You want fresh sandwich? Deli is next door. This is BODEGA. We got candy, cigarettes, disappointment.",
    "Bathroom is for CUSTOMERS ONLY. You buy something, then maybe I give you key. Big maybe.",
    "That slushie machine been broken since '92. Don't even ask. I put sign up YESTERDAY.",
    "You paying with quarters? *sighs* Fine. But you COUNT first. I'm not bank teller.",
    "Kids come in here, they say 'Mr. Kim, why you so mean?' I'm not mean! I'm REALISTIC.",
    "*slaps counter* No scratchers! This is reputable establishment! ...okay yes, I have scratchers. Behind counter.",
    "You lucky I even OPEN today. I should retire, move to Florida. But who would run bodega? Nobody!"
  ],
  "createdAt": "2025-11-13T12:00:00Z",
  "modifiedAt": "2025-11-13T12:00:00Z"
}
