{
  "id": "bumpy_wumpie",
  "type": "npc",
  "definition": "monster",
  "name": "Bumpy the Wino Wumpie",
  "description": "A philosophically inclined wumpie with matted gray-brown fur and a nose that's seen better decades. He's wrapped in what might have once been a respected business suit, now transformed through mysterious alchemical processes into something that could qualify as abstract art. A mostly-empty bottle of 'Night Train' - the beverage equivalent of existential dread - dangles from one paw. His eyes have that faraway look of someone contemplating either the meaning of existence or trying to remember where he left his other shoe. He sways gently even when sitting still, like a furry metronome set to 'melancholy.' A faded name tag reads 'ASSISTANT REGIONAL MANAGER' from a company that definitely doesn't exist anymore.",
  "keywords": ["bumpy", "wumpie", "wino", "drunk", "homeless", "philosopher"],
  "currentRoom": "condemned_01",
  "level": 2,
  "hp": 45,
  "maxHp": 45,
  "wanders": false,
  "heartbeatInterval": 50,
  "dialogue": [
    "*slurs* Y'know what's... what's REALLY the condemned building? SOCIETY, man. We're ALL condemned. Deep.",
    "Spare some change? I'm saving up for... for... *forgets* ...something important. Very important.",
    "I used to BE somebody. I was MIDDLE MANAGEMENT. Had a CUBICLE and everything. *takes swig*",
    "*hiccups* The meaning of life is... is like a... like a Furby. Creepy and you can't turn it off.",
    "They say you can't go home again. Well, JOKE'S ON THEM. I never left this stoop. I WIN.",
    "*waves bottle philosophically* Schrödinger's cat was both drunk AND sober until someone checked the box.",
    "Back in my day, we had RECESSIONS. Real ones. With character. Not like these modern recessions.",
    "You know what the problem with the American Dream is? *pauses* ...I forgot. But it was PROFOUND.",
    "*squints* You look like someone who appreciates fine wine. This ain't it. But I appreciate you appreciating.",
    "I been sitting here so long, I've become one with the steps. We're symbiotic now. It's beautiful.",
    "The stockmarket crashed in '87, my marriage crashed in '92, and I crashed on these steps in '95. Pattern!",
    "*gestures wildly* Reality Street? More like... like... FUTILITY Street. Nailed it. Still got it.",
    "Sometimes I wonder if I'm a wumpie dreaming I'm a philosopher, or a philosopher dreaming I'm a wumpie.",
    "I coulda been a CONTENDER. Instead I'm a BARTENDER. Wait, no. Neither. I'm confused now.",
    "*offers bottle* Want some? It's aged. By which I mean it's been open three days. That's aging, right?",
    "The rent may be too high, but my standards are LOWER. Economics! *taps head, misses*"
  ],
  "createdAt": "2025-11-13T12:00:00Z",
  "modifiedAt": "2025-11-13T12:00:00Z"
}
