{
  "id": "butthead",
  "type": "npc",
  "definition": "monster",
  "name": "Butt-Head",
  "description": "A teenager with dark hair and braces that create a permanent metal-mouthed smirk. He wears a faded Metallica t-shirt like it's a badge of honor, which it probably is in his limited worldview. His posture suggests someone who peaked at 'slightly taller than Beavis' and built his entire personality around it. The expression on his face is one of smug superiority, which is impressive given that his IQ could probably be measured in single digits. He has the unsettling habit of laughing at absolutely nothing, or possibly at concepts he doesn't fully understand - which is most concepts. There's an air of casual malevolence about him, like a bully who's too lazy to actually commit to the bullying.",
  "keywords": ["butthead", "butt-head", "student", "teen", "teenage", "boy", "brown", "braces"],
  "currentRoom": "school_hallway",
  "level": 4,
  "hp": 65,
  "maxHp": 65,
  "wanders": true,
  "heartbeatInterval": 55,
  "territory": [
    "school_hallway",
    "school_classroom_01",
    "school_classroom_02",
    "school_entrance"
  ],
  "dialogue": [
    "Uh huh huh huh. This is cool.",
    "Shut up, Beavis. You're a dumbass. Uh huh huh.",
    "Uh huh huh. You said 'duty'. Huh huh huh.",
    "This sucks more than that time we watched that thing. Uh huh huh.",
    "Uh huh huh. Are there gonna be, like, explosions? That'd be cool.",
    "I'm like, the smart one. Uh huh huh. Beavis is a buttmunch.",
    "Uh huh huh huh. Chicks dig me. I'm pretty sure. Uh huh.",
    "School is for dumbasses. Good thing I'm here. Uh huh huh.",
    "Uh huh huh. This one time, we like, did this thing. It was cool. Uh huh.",
    "Settle down, Beavis, before I kick your ass. Uh huh huh.",
    "Uh huh huh. If we're not supposed to break it, why'd they make it so breakable? Huh huh.",
    "Work is for losers. Uh huh huh. That's why I'm gonna be a roadie.",
    "Uh huh huh. Todd is cool. We're cool. Everything's cool. Uh huh.",
    "Hey baby. Uh huh huh. Wanna make out or something? Uh huh huh huh.",
    "Beavis, you butthole, stop being such a wuss. Uh huh huh.",
    "Uh huh huh. Violence is cool. Uh huh. Not like, against ME though.",
    "This is gonna be cool. Uh huh huh. No wait, this sucks. Uh huh.",
    "Uh huh huh huh. I'm gonna score. Unlike Beavis. He's never gonna score. Uh huh.",
    "Mr. Anderson is a dillhole. Uh huh huh. All teachers are dillholes.",
    "Uh huh huh. Come to Butt-Head. Huh huh huh huh."
  ],
  "createdAt": "2025-11-13T12:00:00Z",
  "modifiedAt": "2025-11-13T12:00:00Z"
}
