{
  "id": "clinic_nurse",
  "type": "npc",
  "definition": "monster",
  "name": "Nurse Rodriguez",
  "description": "A healthcare worker who's seen every possible variation of human foolishness and is thoroughly unimpressed by all of it. Her scrubs are decorated with cartoon characters that seem ironic given her perpetually exasperated expression. Dark circles under her eyes suggest she's operating on coffee, spite, and the faint hope that her student loans will somehow pay themselves off. She moves with the efficient precision of someone who's trying to help three times as many patients as the facility was designed for. A stethoscope hangs around her neck like a badge of honor earned through countless double shifts. Behind her, motivational posters about health compete with reality in what might be the most one-sided battle in human history.",
  "keywords": ["rodriguez", "nurse", "healthcare", "medical", "worker", "clinic"],
  "currentRoom": "clinic",
  "level": 4,
  "hp": 65,
  "maxHp": 65,
  "wanders": false,
  "heartbeatInterval": 30,
  "emoteChance": 0.35,
  "dialogueChance": 0.65,
  "wanderChance": 0,
  "dialogue": [
    "Take a number. And by 'number' I mean a seat. We're out of numbers. Budget cuts.",
    "Yes, we're AWARE the waiting room is full. That's WHY it's called a WAITING room. Revolutionary concept.",
    "No, we don't have that medication. Yes, I KNOW you need it. Welcome to healthcare in the 90s.",
    "If you're bleeding, press down HARD. If you're dying, we'll get to you eventually. If you're fine, WHY ARE YOU HERE?",
    "I got my nursing degree to HELP people. Now I mostly help them understand their insurance won't cover it.",
    "I been on shift for fourteen hours. You're gonna need to be more specific than 'it hurts.'",
    "The doctor is running late. The doctor is ALWAYS running late. Plan your medical emergencies accordingly.",
    "No, you can't get antibiotics for the flu. YES, I'm SURE. I went to SCHOOL for this. For YEARS.",
    "Your HMO requires pre-authorization for that. File form 2847-B. Wait six weeks. Then die, probably.",
    "I don't make the rules, I just enforce them while questioning my life choices. NEXT!",
    "You want a pain scale? Ten is childbirth. Your stubbed toe is a THREE. Maybe.",
    "Reality Street Clinic, where we treat symptoms because actually fixing problems costs too much. How can I help you?",
    "Coffee's in the breakroom. By 'coffee' I mean brown water. By 'breakroom' I mean that corner over there.",
    "Medicare, Medicaid, private insurance, or cash? Yeah, I thought so. Fill out these forms.",
    "I became a nurse to make a difference. The difference is I'm now $40,000 in debt with back pain. Success!",
    "Hippocratic Oath didn't mention PAPERWORK. It's all PAPERWORK. Medicine is just a SIDE GIG at this point."
  ],
  "emoteActions": [
    "doesn't even look up from her paperwork",
    "sighs like the weight of the world is on her shoulders",
    "rubs her temples wearily",
    "delivers this line completely deadpan",
    "answers the phone with practiced exhaustion",
    "looks at you with tired judgment",
    "mutters while filling out forms"
  ],
  "createdAt": "2025-11-13T12:00:00Z",
  "modifiedAt": "2025-11-13T12:00:00Z"
}
