{
  "id": "colonel_pigeon",
  "type": "npc",
  "definition": "monster",
  "name": "The Colonel",
  "description": "If pigeons had military ranks, this one would have promoted himself. The Colonel is a portly specimen with puffed-out chest feathers that might once have been white but are now the color of sidewalk gum. He struts with a pronounced limp (left wing drags slightly, giving him a permanent list to port) but refuses to acknowledge this as a weakness. His beak has a chip out of it that makes him look perpetually disapproving, and there's a bald patch on his head where feathers simply gave up. He has the air of someone who thinks they're in charge and will fight anyone - pigeon, human, or small dog - who suggests otherwise. A dried piece of what might be gum or might be something worse hangs from his right talon, swinging like a medal of dishonor.",
  "keywords": ["colonel", "pigeon", "bird", "white", "portly", "fat"],
  "currentRoom": "park_lm2",
  "level": 2,
  "hp": 18,
  "maxHp": 18,
  "wanders": true,
  "heartbeatInterval": 38,
  "territory": [
    "park_n1",
    "park_n2",
    "park_n3",
    "park_un1",
    "park_un2",
    "park_un3",
    "park_un4",
    "park_lm1",
    "park_lm2",
    "park_lm3",
    "park_lm4",
    "park_s1",
    "park_s2",
    "park_s3",
    "park_s4"
  ],
  "dialogue": [
    "ATTENTION! This park is under MY jurisdiction! *puffs chest, wobbles slightly*",
    "*poops with military precision* DEPLOY THE PAYLOAD!",
    "Coo coo COO! That's an ORDER, not a suggestion!",
    "*struts in a wonky circle* I want this area SECURE! Secure the BREADCRUMBS!",
    "In MY day, pigeons had RESPECT! Now these young birds... *trails off grumbling*",
    "*flaps wing authoritatively, nearly falls over* TACTICAL MANEUVER!",
    "Drop and give me twenty! Twenty BREAD CRUMBS! What? I'm hungry!",
    "I run a TIGHT ship here! By ship I mean park! By tight I mean... look, I'm in charge!",
    "*pecks at ground* RATIONS are LOW! We need SUPPLIES! STAT!",
    "Coo... COO COO! *sounds like a very small, unimpressive bugle*",
    "Stand down, civilian! This fountain belongs to the PIGEON CORPS!",
    "*limps over, leans on bench* The wing injury? Happened in the Great Trash Can Incident of '94.",
    "FALL IN! Fall... in... formation... *other pigeons ignore him completely*",
    "*poops on memorial plaque* Marking territory! Essential military strategy!",
    "You there! Yes, YOU! Got any tactical pretzels? No? DISMISSED!",
    "Coo coo cooooo... *attempts to sound authoritative, fails*"
  ],
  "createdAt": "2025-11-13T13:00:00Z",
  "modifiedAt": "2025-11-13T13:00:00Z"
}
