{
  "id": "daria",
  "type": "npc",
  "definition": "monster",
  "name": "Daria Morgendorffer",
  "description": "A teenage girl with a perpetual expression of withering disdain, as if the entire world is a disappointing sitcom she's been forced to watch. Large round glasses magnify eyes that have seen through everyone's nonsense since approximately age six. Her green jacket and orange shirt combination suggests someone who's moved beyond caring about color coordination into a realm of pure pragmatic defiance. She stands with the posture of someone waiting for society to get its act together, knowing full well it never will. Every so often, she delivers an observation so devastatingly deadpan that it takes people several seconds to realize they've been intellectually eviscerated. There's an aura of intense intelligence being deliberately wasted on her surroundings.",
  "keywords": ["daria", "morgendorffer", "student", "girl", "teen", "glasses", "cynical"],
  "currentRoom": "school_classroom_01",
  "level": 5,
  "hp": 70,
  "maxHp": 70,
  "wanders": true,
  "heartbeatInterval": 70,
  "territory": [
    "school_hallway",
    "school_classroom_01",
    "school_classroom_02",
    "school_office"
  ],
  "dialogue": [
    "Fascinating. Another day in this monument to mediocrity.",
    "I'd comment on the absurdity of this situation, but I'm trying to conserve my energy for more futile endeavors.",
    "Oh good. Another opportunity to watch evolution run backward.",
    "Nothing says 'quality education' quite like a building that's slowly being reclaimed by nature.",
    "I'm surrounded by people whose ambitions peaked at 'breathing regularly.' How inspirational.",
    "Reality Street: Where dreams come to die, then get mugged, then fill out paperwork about it.",
    "The irony of calling this 'Highland High' when we're at the absolute lowest point of civilization is not lost on me.",
    "I'd be more enthusiastic, but my cynicism gland is working overtime today. So, normal Tuesday.",
    "Yes, I'm having a wonderful time. Can't you tell by my complete lack of facial expression?",
    "Another profound moment in my journey through the intellectual wasteland known as high school.",
    "If apathy were an Olympic sport, this school would still find a way to lose.",
    "I've seen more intelligent life in a petri dish. And that includes the petri dish.",
    "La la LA la la. Just practicing my Jell-O jingle for when I inevitably sell out.",
    "Nothing says 'bright future' like institutionalized boredom punctuated by occasional cafeteria food.",
    "Oh look, another teaching moment. How delightful. Wake me when it's over.",
    "I'm not anti-social. I'm just pro-solitude. There's a difference, though I doubt you'd understand it.",
    "Highland High: Where the dress code is more enforced than critical thinking.",
    "I'd explain the futility of your endeavors, but that would require you to understand the concept of futility.",
    "Some people see the glass as half full. I see it as a metaphor for mankind's desperate need for validation.",
    "Sick sad world, population: everyone but me. And I'm stuck here as an observer."
  ],
  "createdAt": "2025-11-13T12:00:00Z",
  "modifiedAt": "2025-11-13T12:00:00Z"
}
