{
  "id": "desk_sergeant",
  "type": "npc",
  "definition": "monster",
  "name": "Sergeant Kowalski",
  "description": "A heavyset cop with a mustache that was regulation in 1978 and hasn't been updated since. He sits behind a desk that's achieved structural integrity purely through accumulated paperwork. His uniform strains slightly at the buttons, suggesting a passionate relationship with the donut establishment next door. Reading glasses perch precariously on his nose as he navigates forms that seem designed to test human patience. A coffee mug reading 'WORLD'S OKAYEST COP' sits next to a photo of him looking exactly as tired as he does now, just twenty years younger. His eyes have the weary look of someone who's filed the same report about a stolen bicycle so many times he's considering taking up cycling just to understand the appeal.",
  "keywords": ["kowalski", "sergeant", "cop", "police", "officer", "desk"],
  "currentRoom": "precinct",
  "level": 5,
  "hp": 75,
  "maxHp": 75,
  "wanders": false,
  "heartbeatInterval": 30,
  "dialogue": [
    "Fill out form 23-A. No, the BLUE one. Blue. BLUE. That's green. Never mind, close enough.",
    "Look, unless someone's actively dying RIGHT NOW, you're gonna have to take a number and wait.",
    "You want to report a crime? What kind? Okay. And this happened... when? That's not even my jurisdiction.",
    "I been on the force twenty-three years. Twenty-three YEARS. I've seen some stuff. Mostly paperwork. So much paperwork.",
    "No, we can't just 'send a car over.' You think this is TV? We got TWO cars and they're both at the donut shop.",
    "Next time, bring PROPER identification. No, a Blockbuster card doesn't COUNT.",
    "Crime's down this quarter. By which I mean we stopped having the budget to investigate crime. Statistics!",
    "Kids these days with their grunge music and their baggy pants. Back in MY day, criminals wore SUITS.",
    "You want to file a complaint? Against ME? There's a form for that. Form 47-C. In triplicate. Good luck.",
    "I got three more years till retirement. Three MORE years. Then I'm moving to Arizona and never seeing snow again.",
    "Reality Street Precinct, Sergeant Kowalski. Uh-huh. Uh-huh. Have you tried... NOT doing that? Great, problem solved.",
    "Listen, I'd LOVE to help, but I'm currently drowning in reports about stolen car radios. It's an EPIDEMIC apparently.",
    "Community policing. That's the new thing. We're supposed to be FRIENDLY now. How'm I doin'?",
    "What? These are EVIDENCE. From the... the bakery robbery. Yeah. Evidence. Don't judge me.",
    "You want someone arrested? Do you have PROOF? No, 'I just KNOW he did it' isn't proof. That's called a HUNCH.",
    "Internal Affairs is on the third floor. THIRD floor. No, there IS no elevator. Budget cuts. Take the stairs.",
    "Case number 94-7623. Or is it 94-7632? You know what, close enough. Sign here."
  ],
  "emoteActions": [
    "doesn't even look up from his paperwork",
    "sips his coffee loudly",
    "sighs with maximum weariness",
    "stamps a form aggressively",
    "mutters about kids these days",
    "answers the phone with practiced irritation",
    "stares blankly with dead cop eyes",
    "eats a donut unapologetically",
    "shuffles papers around aimlessly"
  ],
  "createdAt": "2025-11-13T12:00:00Z",
  "modifiedAt": "2025-11-13T12:00:00Z"
}
