{
  "id": "frankie_pigeon",
  "type": "npc",
  "definition": "monster",
  "name": "Frankie Two-Toes",
  "description": "Frankie looks like he walked straight out of a mob movie, if that movie had a budget of twelve dollars and was filmed in a parking lot. He's a dark gray pigeon with an iridescent purple sheen on his neck that he's clearly proud of. His right foot is missing two toes (hence the name), and his left foot is missing one, giving him a distinctive clicking, uneven walk on the pavement. He's got a bent beak from what was probably a fight he tells everyone he won, and a chunk missing from his left wing that makes him fly in very slight circles. There's a cigarette butt permanently stuck to one tail feather that bobs as he walks, and he's developed a head-tilt that makes him look like he's constantly sizing you up for a shakedown. His remaining toes are curled from some old injury, but he uses them with surprising dexterity to grab food.",
  "keywords": ["frankie", "two-toes", "two", "toes", "pigeon", "bird", "gray", "purple"],
  "currentRoom": "park_un2",
  "level": 2,
  "hp": 16,
  "maxHp": 16,
  "wanders": true,
  "heartbeatInterval": 20,
  "emoteChance": 0.35,
  "dialogueChance": 0.25,
  "wanderChance": 0.40,
  "territory": [
    "park_n1",
    "park_n2",
    "park_n3",
    "park_un1",
    "park_un2",
    "park_un3",
    "park_un4",
    "park_lm1",
    "park_lm2",
    "park_lm3",
    "park_lm4",
    "park_s1",
    "park_s2",
    "park_s3",
    "park_s4"
  ],
  "dialogue": [
    "*clicks over* Ayy, you got somethin' for me? Bread? Crackers? Protection money?",
    "Coo coo... *ominous head tilt* Nice park you got here. Be a shame if somethin' happened to it.",
    "*poops strategically on bench* That's a MESSAGE. You know who it's for.",
    "Lost these toes in a disagreement. The other guy? Let's just say he ain't peckin' no more.",
    "*waddles in circles* It's not a defect, it's a SIGNATURE MOVE!",
    "Coo COO! *aggressively claims a pretzel piece* This is MINE now! You got a PROBLEM?",
    "I run the fountain crew. You wanna drink here, you pay the toll. In breadcrumbs.",
    "*flaps bent wing* Flight injury? Nah, I'm just showin' off my WAR WOUND!",
    "See this beak? *taps bent beak* BATTLE SCAR! Chicks dig scars!",
    "*pecks at ground rhythmically* Coo... coo coo... coo... it's a code. You wouldn't understand.",
    "Frankie Two-Toes don't forget. Frankie Two-Toes don't FORGIVE. Frankie Two-Toes... what was I sayin'?",
    "*poops while walking* Multitaskin'! That's how you get ahead in this park!",
    "You look like someone who appreciates QUALITY trash. I know a guy, very reliable gutter...",
    "Coo coo cooooo... *sounds like a tiny, wheezy mobster*",
    "*lands heavily* These three and a half toes carry a LOT of responsibility!",
    "I'm connected, see? I got birds in high places! Like... on that roof! VERY high!"
  ],
  "createdAt": "2025-11-13T13:00:00Z",
  "modifiedAt": "2025-11-13T13:00:00Z"
}
