{
  "id": "greasy_pigeon",
  "type": "npc",
  "definition": "monster",
  "name": "Greasy Pete",
  "description": "This pigeon looks like he fell into a vat of motor oil and just decided to lean into it. Every feather glistens with an oily sheen that creates rainbow patterns in the light - beautiful in a deeply unsettling way. He leaves small grease spots wherever he lands, and there's an actual visible drip trail following him as he waddles. One leg is significantly shorter than the other, giving him a rolling, sailor-like gait that's hypnotic to watch. His eyes have a slightly manic gleam, possibly from huffing whatever he's covered in. Small bits of trash - a cigarette filter, part of a straw wrapper, something that might be tinfoil - are stuck to various parts of his body, creating an avant-garde sculpture of urban decay. He smells like a parking garage.",
  "keywords": ["greasy", "pete", "pigeon", "bird", "oily", "shiny"],
  "currentRoom": "park_un3",
  "level": 1,
  "hp": 15,
  "maxHp": 15,
  "wanders": true,
  "heartbeatInterval": 45,
  "territory": [
    "park_n1",
    "park_n2",
    "park_n3",
    "park_un1",
    "park_un2",
    "park_un3",
    "park_un4",
    "park_lm1",
    "park_lm2",
    "park_lm3",
    "park_lm4",
    "park_s1",
    "park_s2",
    "park_s3",
    "park_s4"
  ],
  "dialogue": [
    "*waddles past, leaving oily footprints* Coo coo... I'm GLISTENING!",
    "Found a puddle behind the auto shop. Best bath I ever took! *is clearly lying*",
    "*poops, it slides off the bench* Even my poop is LUBRICATED!",
    "Coo... coo coo... *sounds slightly woozy*",
    "*tries to preen, just spreads the oil around* Lookin' GOOD, lookin' SHINY!",
    "You think I'm dirty? I'm WEATHERPROOFED! Try peckin' THAT, rain!",
    "*waddles in lopsided circles* Short leg life! Every day is leg day when you're compensating!",
    "Found half a gyro in the gutter. Still counts as Mediterranean cuisine!",
    "*flaps wings, oil droplets fly everywhere* SHARING THE WEALTH!",
    "Coo coo cooooo... *trails off into wheezing*",
    "*lands on clean surface, immediately makes it less clean*",
    "I'm not greasy, I'm AERODYNAMIC! The oil reduces drag! SCIENCE!",
    "*pecks at french fry, it slips away* Come back here, you slippery... oh wait, that's me.",
    "Some birds got fancy colors. I got INDUSTRIAL SHEEN! Just as good!",
    "*poops mid-waddle without stopping* Efficiency!",
    "Coo COO! *attempts to shake off oil, fails spectacularly*"
  ],
  "createdAt": "2025-11-13T13:00:00Z",
  "modifiedAt": "2025-11-13T13:00:00Z"
}
