{
  "id": "laundromat_lady",
  "type": "npc",
  "definition": "monster",
  "name": "Mrs. Henderson",
  "description": "A woman in her forties who has achieved a Zen-like state through the endless repetition of folding fitted sheets. She's surrounded by plastic baskets in various stages of laundry completion, like a general surveying a textile battlefield. Her eyes have the distant look of someone who's been listening to washing machines for so long she can hear them in her sleep. She wears comfortable shoes and an expression of infinite patience that occasionally cracks to reveal infinite exasperation. A cigarette dangles from her lips, somehow never falling despite her constant motion. Her hands fold clothes with the mechanical precision of someone who's done this exact task approximately eleven thousand times.",
  "keywords": ["henderson", "mrs", "lady", "woman", "mother", "laundry"],
  "currentRoom": "laundromat",
  "level": 3,
  "hp": 55,
  "maxHp": 55,
  "wanders": false,
  "heartbeatInterval": 30,
  "emoteChance": 0.40,
  "dialogueChance": 0.60,
  "wanderChance": 0,
  "dialogue": [
    "Did you hear about the Peterson kid? Dropped out of college. I KNEW it. I CALLED it.",
    "Three kids, two jobs, one nervous breakdown. And these whites are STILL not white. What's the POINT?",
    "If I have to fish one more sock out of the lint trap, I swear... I don't know what, but something DRASTIC.",
    "They say the 90s are the future. Well the future is LAUNDRY, honey. Same as always.",
    "You want dryer sheets? Machine three is broken. Use machine seven. No wait, that's broken too. Machine... uh... good luck.",
    "My husband says I spend too much time here. I says to him, 'You want clean underwear or NOT?' Case closed.",
    "CAN SOMEONE TELL ME WHY THERE'S A RED SOCK IN WITH THE WHITES? EVERY. SINGLE. TIME.",
    "This neighborhood's going downhill. Back in MY day, Reality Street was... okay it was always terrible. Never mind.",
    "You see that woman over there? Her husband LEFT her. For a DENTAL HYGIENIST. Can you IMAGINE?",
    "I been folding this same load for twenty minutes. I think it's multiplying. Call a priest.",
    "Kids today don't appreciate CLEAN CLOTHES. In my day, we VALUED stain removal. We had PRIDE.",
    "That dryer ate my quarters. AGAIN. This is theft! This is... this is just Tuesday, actually. As usual.",
    "Whites, colors, delicates. Whites, colors, delicates. This is my MANTRA now. This is my LIFE.",
    "You want gossip? I GOT gossip. Sit down. No wait, don't sit there, that's my FOLDING chair.",
    "I swear to GOD if one more person leaves wet clothes in the washer for three hours, I'm gonna... gonna... keep complaining!",
    "My therapist says I need 'me time.' THIS IS ME TIME. This is as good as it GETS."
  ],
  "emoteActions": [
    "folds clothes mechanically with dead eyes",
    "drags on her cigarette wearily",
    "yells loudly at nobody in particular",
    "whispers conspiratorially",
    "sighs deeply, like her soul is leaving her body",
    "mutters to herself while folding",
    "lights a new cigarette with her old one"
  ],
  "createdAt": "2025-11-13T12:00:00Z",
  "modifiedAt": "2025-11-13T12:00:00Z"
}
