{
  "id": "motor_mouth_jay",
  "type": "npc",
  "definition": "monster",
  "name": "Motor-Mouth Jay",
  "description": "Standing before you is a hyperactive whirlwind of 90s slacker energy who appears to be physically incapable of shutting up. Motor-Mouth Jay sports bleached-blonde hair that's attempting to escape from under a backwards basketball cap adorned with a faded cartoon character nobody remembers. His oversized windbreaker jacket—in that special combination of teal and purple that screamed '1995'—hangs open to reveal a band t-shirt for a group that definitely broke up. Baggy jeans sag precariously low, held in place by a studded belt and supplemented by a chain wallet that could double as a morning star. Battered skate shoes that might once have been white complete the ensemble. He's got that twitchy, can't-stand-still energy of someone who's either had way too much caffeine or way too little sleep, constantly gesturing wildly as he unleashes a stream of consciousness that would make James Joyce say 'dude, focus.' A skateboard leans against the bodega wall behind him, covered in stickers no one can read anymore. The distinct aroma of cheap weed and cheaper cologne follows him like a particularly persistent ghost. He's currently leaning against the wall outside the bodega, harassing anyone who dares to make eye contact.",
  "keywords": ["jay", "motor", "mouth", "slacker", "stoner", "blonde", "loud", "skater", "windbreaker"],
  "currentRoom": "reality_street_east_02",
  "level": 3,
  "hp": 50,
  "maxHp": 50,
  "wanders": false,
  "heartbeatInterval": 65,
  "dialogue": [
    "Yo, you got a dollar? I ain't gonna lie to you—it's for weed. At least I'm honest, right?",
    "So I'm telling you, man, the government is DEFINITELY putting something in Slurpees. Why else would they taste so good at 2 AM?",
    "Check it—me and Bobby had this GENIUS plan last week involving a shopping cart and the 7-Eleven parking lot, but then we got distracted by this really philosophical conversation about why hot dogs come in packs of ten but buns come in packs of eight. It's a conspiracy, yo!",
    "Dude, I swear that pigeon over there is giving me the stink-eye. What's your problem, bird? You want some of this? *makes crude gesture at pigeon*",
    "You know what's messed up? Grape flavor doesn't taste like grapes. What the hell DOES it taste like? This keeps me up at night, man.",
    "This one time, right, me and Bobby scored these vintage porno mags from behind the gas station, and—oh wait, you probably don't wanna hear about that. Unless you do? No? Cool, cool.",
    "I'm not saying I'm broke, but I just tried to pay for a 40 with nickels and the clerk literally started crying. That's when you know the economy's bad, man.",
    "Yo, you heading into the bodega? Tell 'em Jay needs that fifty cents he's owed. They know what I'm talking about. They don't? Well, they do NOW.",
    "Some dude tried to tell me skateboarding isn't a real sport. I was like, 'Bro, I've got scars in places that would make a doctor uncomfortable.' Respect the board, man.",
    "Bobby thinks I talk too much. Can you believe that? ME? I'm like the KING of knowing when to shut up. For example, right now I could keep talking but instead I'm gonna... okay yeah, I see your point.",
    "*gestures wildly* So there's this theory, right, that Bigfoot is just a really hairy dude who's SUPER good at hide and seek. Think about it!",
    "Dude, you smell like you got a job. That's rough, man. My condolences. Me and Bobby, we're in between career opportunities right now. Permanently.",
    "Check out this sick move! *attempts kickflip, skateboard goes flying* ...Yeah, okay, I meant to do that. That's called 'street style.' Very avant-garde.",
    "I'm not saying the bodega clerk is dealing from behind the counter, but I AM saying that his 'energy drinks' have very interesting side effects. Very... giggly side effects.",
    "Man, why do people always cross the street when they see me coming? Is it the jacket? It's the jacket, isn't it? This jacket is VINTAGE, yo!",
    "Bobby once went three days without saying a word. THREE DAYS. I thought maybe he was dead but he just... wasn't feeling chatty. Meanwhile, I can't shut up for three MINUTES.",
    "You ever notice how reality is like... really real? Like, THIS real. *waves hand around* Heavy stuff, man.",
    "So I'm working on this screenplay, right? It's about these two guys who hang out outside a convenience store. TOTALLY original. Nobody's done that before.",
    "That pigeon gang over in the park? Yeah, we cool. Me and the Colonel got an understanding. He don't hassle me about loitering, I don't hassle him about the whole 'pooping on things' situation.",
    "*lights cigarette* You know what this street needs? More opportunities for entrepreneurially-minded individuals such as myself. And by that I mean someone who'll buy my mixtape."
  ],
  "createdAt": "2025-11-13T14:00:00Z",
  "modifiedAt": "2025-11-13T14:00:00Z"
}
