{
  "id": "one_foot_pigeon",
  "type": "npc",
  "definition": "monster",
  "name": "One-Foot",
  "description": "This pigeon has seen some things. Specifically, he's seen whatever took his left foot, though he's not talking about it. He hops around on his remaining leg with the grim determination of a war veteran, his gray feathers mottled with oil stains that shimmer in an almost psychedelic pattern. Where his left foot should be is just a gnarly stump that he occasionally uses to scratch his head in a move that's equal parts disturbing and impressive. His remaining talons are crusted with unidentifiable street gunk, and one eye has developed a permanent squint - possibly from an old injury, possibly from years of judging passersby. He carries himself with the swagger of someone who survived the worst the city could throw at him and came back hopping.",
  "keywords": ["one-foot", "one", "foot", "pigeon", "bird", "gray", "oil"],
  "currentRoom": "park_n2",
  "level": 1,
  "hp": 12,
  "maxHp": 12,
  "wanders": true,
  "heartbeatInterval": 20,
  "emoteChance": 0.40,
  "dialogueChance": 0.20,
  "wanderChance": 0.40,
  "territory": [
    "park_n1",
    "park_n2",
    "park_n3",
    "park_un1",
    "park_un2",
    "park_un3",
    "park_un4",
    "park_lm1",
    "park_lm2",
    "park_lm3",
    "park_lm4",
    "park_s1",
    "park_s2",
    "park_s3",
    "park_s4"
  ],
  "dialogue": [
    "Coo coo...",
    "You think YOU got problems? I got ONE FOOT and I'm still here!",
    "Somebody dropped a HALF a cheeto? HALF? The disrespect!",
    "This is MY bench. I lost my foot defendin' this bench. Show some respect.",
    "I survived a TAXI. What have YOU survived today?",
    "Coo coo, cooooo...",
    "Mine. All mine. The whole park. Don't test me.",
    "I seen things you people wouldn't believe. Attack pigeons on fire off the shoulder of Orion... Wait, that ain't right.",
    "This move never gets old. Well, for ME it don't.",
    "You got bread? No? Then keep walkin', two-feet.",
    "BOOM. Still got it.",
    "Lost my foot in '92. Or was it '93? Time loses meaning when you're a pigeon.",
    "Coo COO!",
    "I can smell fear. And hot dogs. Mostly hot dogs."
  ],
  "emoteActions": [
    "hops aggressively toward a discarded french fry",
    "poops on a bench with the precision of a sniper",
    "pecks at the ground furiously",
    "flaps his wings dramatically",
    "sounds vaguely threatening",
    "hops in a circle, marking his territory",
    "scratches his head with his stump",
    "lands on a railing and poops immediately",
    "aggressively defends a pizza crust from an imaginary threat",
    "hops closer, one-legged but menacing"
  ],
  "createdAt": "2025-11-13T13:00:00Z",
  "modifiedAt": "2025-11-13T13:00:00Z"
}
