{
  "id": "patches_pigeon",
  "type": "npc",
  "definition": "monster",
  "name": "Patches",
  "description": "This pigeon appears to be molting in the most aggressive and aesthetically unfortunate way possible. Large bald patches dot her body in a pattern that suggests either a terrible disease or a really bad argument with a cat - possibly both. The remaining feathers stick up at odd angles, giving her a perpetually electrocuted appearance. Her neck is almost completely bare, revealing wrinkled pink skin that nobody asked to see. She walks with a distinctive head-bobbing limp, and one eye is clouded over (though this doesn't seem to slow her down). Despite her appearance, or perhaps because of it, she carries herself with the confidence of someone who has nothing left to lose. A piece of old chewing gum is stuck to her back, and she's clearly given up trying to remove it.",
  "keywords": ["patches", "pigeon", "bird", "bald", "molting", "pink"],
  "currentRoom": "park_s2",
  "level": 1,
  "hp": 10,
  "maxHp": 10,
  "wanders": true,
  "heartbeatInterval": 40,
  "territory": [
    "park_n1",
    "park_n2",
    "park_n3",
    "park_un1",
    "park_un2",
    "park_un3",
    "park_un4",
    "park_lm1",
    "park_lm2",
    "park_lm3",
    "park_lm4",
    "park_s1",
    "park_s2",
    "park_s3",
    "park_s4"
  ],
  "dialogue": [
    "Coo coo... *head bobs violently* It's a CONDITION, okay? Jeez!",
    "*poops on slide* That's for the kids who threw rocks at me!",
    "I'm not molting, I'm SHEDDING! For summer! In November! SHUT UP!",
    "*pecks aggressively at nothing* You lookin' at my bald spots? YOU LOOKIN'?!",
    "Lost most of my feathers in the Great Cat War. The other pigeons? They didn't make it.",
    "Coo... coo coo COOOOO! *sounds indignant*",
    "*waddles past* I'm AERODYNAMIC now! Less drag! Ask any physicist!",
    "Found a whole slice of pizza yesterday. WHOLE slice. Life's lookin' up!",
    "*tries to preen nonexistent feathers* Phantom feather syndrome is REAL!",
    "You think I'm ugly? I think YOU'RE ugly! How you like THAT?!",
    "*poops while maintaining aggressive eye contact*",
    "Coo coo... *surprisingly menacing*",
    "*scratches bald patch with talon* Sometimes I can still feel 'em... the feathers that were...",
    "I survived THREE hawks, TWO cats, and ONE very determined squirrel! RESPECT!",
    "*flaps patchy wings* Still fly! Badly, but STILL!",
    "The gum on my back? That's from 1997. It's VINTAGE now!"
  ],
  "createdAt": "2025-11-13T13:00:00Z",
  "modifiedAt": "2025-11-13T13:00:00Z"
}
