{
  "id": "pawnbroker",
  "type": "npc",
  "definition": "monster",
  "name": "Shifty Eddie",
  "description": "A wiry man with the kind of smile that makes people instinctively check their wallets. He's draped in gold chains that are definitely, absolutely, one hundred percent real - don't even question it. His mustache seems to have its own agenda, possibly involving world domination. Behind him, shelves overflow with an archaeological dig's worth of random objects: VCRs, guitars missing strings, jewelry of questionable provenance, and what might be a stuffed peacock. He has the supernatural ability to assess the value of any item by squinting at it while making 'hmm' sounds that somehow translate to 'I'll give you five bucks.' A sign behind him reads 'IN GOD WE TRUST, EVERYONE ELSE PAYS CASH.'",
  "keywords": ["eddie", "shifty", "pawnbroker", "dealer", "broker", "shady"],
  "currentRoom": "pawnshop",
  "level": 4,
  "hp": 65,
  "maxHp": 65,
  "wanders": false,
  "heartbeatInterval": 30,
  "dialogue": [
    "Best prices on Reality Street! Also worst prices. Also ONLY prices. It's a monopoly situation.",
    "What are you SELLING today? I mean... how can I help you? Same thing, really.",
    "This watch? Real Rolex. Fell off truck. Very sad truck accident. No more questions.",
    "I give you good deal because I LIKE you. Also because legally I have to report anything over $500.",
    "You want to pawn it or sell it? Pawn means you come BACK. Sell means... well, you get the idea.",
    "Hmm. Hmm. HMMM. Best I can do is seven dollars and this expired coupon for Sizzler.",
    "No no, you don't understand. This TV is VINTAGE. From 1987! That's... that's RETRO now. Very valuable.",
    "ID? Why you need to see ID? Fine, FINE. Government always in my business. Can't even fence stolen goods in peace.",
    "That guitar signed by Kurt Cobain! Or someone named Kurt. Possibly just says 'curt.' Still valuable!",
    "You looking for anything... SPECIFIC? I got a guy. Well, my cousin's guy's guy. But still.",
    "Cash only! What you think this is, department store? I don't even trust MYSELF with credit card machine.",
    "Business is BOOMING. By which I mean people are desperate. Economically speaking, I'm thriving on misery!",
    "This lamp grants THREE WISHES. Or it's just lamp. Fifty-fifty chance. You feeling lucky?",
    "This merchandise looks FAMILIAR. Did you... did you buy this from me last week? RESPECT the hustle!",
    "I been in this business thirty years. I seen it ALL. Mostly seen people overestimate their junk's value.",
    "No refunds, no exchanges, no guarantees, no warranties, no nothing. Yes, that IS a business model, thank you!"
  ],
  "emoteActions": [
    "rubs his hands together greedily",
    "examines an item with exaggerated scrutiny",
    "whispers conspiratorially",
    "his eyes narrow suspiciously",
    "adjusts his gold chains",
    "squints at you over his glasses"
  ],
  "createdAt": "2025-11-13T12:00:00Z",
  "modifiedAt": "2025-11-13T12:00:00Z"
}
