{
  "id": "tweaky_wumpie",
  "type": "npc",
  "definition": "monster",
  "name": "Tweaky the Wumpie",
  "description": "A disheveled wumpie with fur that looks like it hasn't been groomed since the Bush administration - the first one. His eyes dart nervously in every direction at once, a feat that seems to defy basic biology. He's wearing a stained oversized hoodie with the logo of a band that broke up in 1993, and his paws twitch constantly as if operating an invisible Game Boy. A faint aroma of desperation and discount energy drinks follows him around. Every few seconds he glances over his shoulder at absolutely nothing, muttering to himself about 'the man' and 'good stuff.' Despite his attempt at menace, he's still fundamentally adorable in that tragic-stuffed-animal sort of way.",
  "keywords": ["tweaky", "wumpie", "dealer", "crack", "junkie", "hoodie"],
  "currentRoom": "dark_alley_02",
  "level": 4,
  "hp": 65,
  "maxHp": 65,
  "wanders": true,
  "heartbeatInterval": 20,
  "emoteChance": 0.45,
  "dialogueChance": 0.30,
  "wanderChance": 0.25,
  "territory": [
    "dark_alley_01",
    "dark_alley_02",
    "dark_alley_03",
    "dark_alley_04"
  ],
  "dialogue": [
    "Yo yo yo, you lookin'? I got that good stuff, that PREMIUM stuff. Slightly used Pogs. Mint condition.",
    "Five-oh could be anywhere, man. ANYWHERE. Even in your MIND.",
    "You a cop? You gotta tell me if you're a cop. I saw it on Law & Order.",
    "I got connections, man. My cousin knows a guy who met a dude who once HIGH-FIVED MC Hammer.",
    "These fleas ain't real, man. They're GOVERNMENT fleas. Surveillance fleas.",
    "Back in '94 I had PROSPECTS, man. I was gonna be a Beanie Baby. A RARE one.",
    "You want the hookup? I got bootleg Nirvana tapes. Only slightly melted.",
    "Someone's watching. Always watching. Probably that purple dinosaur. Never trusted him.",
    "I been up for three days straight playing Mortal Kombat. I can SEE the kombat now. It's EVERYWHERE.",
    "Got any change? I need like... forty-seven cents for a very important business transaction.",
    "The 90s are gonna last FOREVER, man. This is PEAK civilization right here. Can't get better than this.",
    "The rent's too damn high. But the GET is too damn fly, know what I'm sayin'?",
    "I seen things, man. THINGS. Like that dancing baby gif. Changed my LIFE.",
    "You think this is a GAME? This is SURVIVAL. Urban decay waits for NO wumpie.",
    "My dealer's pager number is like... uh... carry the one... I forgot. BUT IT'S REAL.",
    "Sometimes I just sit here and think about how much better Crystal Pepsi was than regular Pepsi. Deep thoughts."
  ],
  "emoteActions": [
    "glances around nervously, eyes darting to every shadow",
    "scratches frantically at his fur",
    "twitches and jerks his head around paranoidly",
    "whispers conspiratorially while looking over his shoulder",
    "calculates something on his paws, gets confused, starts over",
    "counts on his paws repeatedly, loses track",
    "pulls his hoodie tighter and peers around suspiciously",
    "jumps at a noise that nobody else heard"
  ],
  "createdAt": "2025-11-13T12:00:00Z",
  "modifiedAt": "2025-11-13T12:00:00Z"
}
