{
  "id": "twitchy_pigeon",
  "type": "npc",
  "definition": "monster",
  "name": "Twitchy",
  "description": "Twitchy earned his name through a combination of genuine neurological issues and what appears to be chronic overcaffeination from pecking at discarded energy drink cans. His head snaps left and right at random intervals, his left wing has a constant tremor, and one leg kicks out periodically as if trying to shake off an invisible bug. He's a mottled brown pigeon with wild, staring eyes that never quite focus on the same thing, and several feathers permanently stick straight up like he's been electrocuted. His beak clicks compulsively - click-click-click - even when he's not eating. Both feet are intact but curl and uncurl rhythmically, making him look like he's perpetually kneading invisible dough. There's a streak of what might be dried coffee down his chest, and he vibrates slightly even when standing still. His movements are jerky and unpredictable, making him both unsettling and oddly fascinating to watch.",
  "keywords": ["twitchy", "pigeon", "bird", "brown", "nervous", "jittery"],
  "currentRoom": "park_lm1",
  "level": 1,
  "hp": 14,
  "maxHp": 14,
  "wanders": true,
  "heartbeatInterval": 18,
  "territory": [
    "park_n1",
    "park_n2",
    "park_n3",
    "park_un1",
    "park_un2",
    "park_un3",
    "park_un4",
    "park_lm1",
    "park_lm2",
    "park_lm3",
    "park_lm4",
    "park_s1",
    "park_s2",
    "park_s3",
    "park_s4"
  ],
  "dialogue": [
    "COO! ...what was that?!",
    "Did you hear that?! WHAT WAS THAT?!",
    "Too much espresso! Found a WHOLE CUP in the trash! WHOLE CUP!",
    "Coo coo coo coo coo coo-",
    "NOT DOING IT ON PURPOSE! IT JUST HAPPENS!",
    "TACTICAL DEPOSIT! Or accident! Honestly could go either way!",
    "Gotta keep moving! Gotta stay alert! PREDATORS EVERYWHERE!",
    "Crumbs! Crumbs! CRUMBS!",
    "Sleep is for pigeons who gave UP! I haven't slept since TUESDAY! What day is it?!",
    "It's fine! THIS IS FINE! Everything's FINE!",
    "Coo-coo-coo- -coo!",
    "Scanning perimeter! All clear! WAIT IS IT?! False alarm!",
    "You startle easy? I LIVE STARTLED! It's a LIFESTYLE CHOICE!",
    "Click-click-click-coo-click-click!",
    "Found a Red Bull puddle last week! BEST WEEK EVER! Didn't blink for THREE DAYS!",
    "EVERYBODY PANIC! Oh wait, false alarm! PANIC ANYWAY!"
  ],
  "emoteActions": [
    "snaps his head left, then right, then up in rapid succession",
    "vibrates intensely like he's plugged into a socket",
    "kicks his leg spasmodically",
    "poops mid-twitch",
    "pecks at the ground frantically, finding nothing but continuing anyway",
    "wing tremors intensify dramatically",
    "gets interrupted by his own hiccup",
    "spins in a jerky, spasmodic circle",
    "his beak clicks rapidly and uncontrollably",
    "suddenly freezes, then explodes into frantic motion"
  ],
  "createdAt": "2025-11-13T13:00:00Z",
  "modifiedAt": "2025-11-13T13:00:00Z"
}
